# Úkol č. 10

## Zadání 1

### Uvažuj, že zpracováváš analýzu pro softwarovou firmu. Firma má kanceláře v Praze, Plzni a Liberci. Seznam zaměstnanců pro jednotlivé kanceláře najdeš v souborech zam_praha.csv, zam_plzeň.csv a zam_liberec.csv.

#### Načti data o zaměstnancích z CSV souborů do tabulek (DataFrame). Ke každé tabulce přidej nový sloupec mesto, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [1]:
import pandas

In [3]:
zam_praha = pandas.read_csv("zam_praha.csv")
zam_plzen = pandas.read_csv("zam_plzen.csv")
zam_liberec = pandas.read_csv("zam_liberec.csv")

zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance
0     Brian      Hall  +421 949 656 098                 30
1     Marta  Kolářová       730 456 163                 32
2      John   Moravec       725 092 179                 33
3  Dominika   Kopecká       722 747 626                 34
4    Marcel     Hájek  +421 902 928 669                 35

In [4]:
zam_plzen.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0     Stacy  Pospíšilová       727 293 880                  3
1     Matěj         Král       770 787 377                  6
2    Amanda       Wilson  +421 52 656 7231                  7
3     Angel       Wilson  +421 52 135 2491                  8
4  Jindřich       Howell  +421 39 043 0948                 10

In [5]:

zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance
0       Nela      Šťastná       728 454 176                 83
1    Heather      Marková       604 404 522                 84
2     Krista  Procházková  +421 50 444 5544                 85
3   Jennifer        Brown       775 545 190                 86
4  Ladislava    Blackwell  +421 913 487 200                 87

#### Přidáme sloupec "mesto" do všech tabulek

In [6]:
zam_praha["mesto"] = "Praha"
zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

In [7]:
zam_plzen["mesto"] = "Plzeň"
zam_plzen.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Stacy  Pospíšilová       727 293 880                  3  Plzeň
1     Matěj         Král       770 787 377                  6  Plzeň
2    Amanda       Wilson  +421 52 656 7231                  7  Plzeň
3     Angel       Wilson  +421 52 135 2491                  8  Plzeň
4  Jindřich       Howell  +421 39 043 0948                 10  Plzeň

In [8]:
zam_liberec["mesto"] = "Liberec"
zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance    mesto
0       Nela      Šťastná       728 454 176                 83  Liberec
1    Heather      Marková       604 404 522                 84  Liberec
2     Krista  Procházková  +421 50 444 5544                 85  Liberec
3   Jennifer        Brown       775 545 190                 86  Liberec
4  Ladislava    Blackwell  +421 913 487 200                 87  Liberec

#### Vytvoř novou tabulku zamestnanci a ulož do ní informace o všech zaměstnancích (operace concat).

In [11]:
zamestnanci = pandas.concat([zam_praha, zam_plzen, zam_liberec], ignore_index=True)
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

### Ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021. Propoj tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

##### Načteme soubor platy_2021_02.csv

In [12]:
platy = pandas.read_csv("platy_2021_02.csv")
platy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cislo_zamestnance  43 non-null     int64
 1   plat               43 non-null     float64
dtypes: float64(1), int64(1)
memory usage: 816.0 bytes

##### Propojíme tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

In [20]:
propoj_tabulky = zamestnanci.join(platy.set_index("cislo_zamestnance"), on="cislo_zamestnance")
propoj_tabulky.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.8+ KB

### Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [17]:
zamestnanci.shape
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

In [18]:
propoj_tabulky.shape
propoj_tabulky.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.8+ KB

#### Z předchozího tedy vyplývá, že ve sloupci plat je jenom 43 nenulových hodnot, tady z 56 zaměstnanců mělo plat za únor 43.

### Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.

##### Průměrný plat v Praze

In [22]:
prum_plat_praha = propoj_tabulky.loc[propoj_tabulky["mesto"] == "Praha", "plat"].mean()
print(prum_plat_praha)

43295.23809523809

##### Průměrný plat v Plzni

In [23]:
prum_plat_plzen = propoj_tabulky.loc[propoj_tabulky["mesto"] == "Plzeň", "plat"].mean()
print(prum_plat_plzen)

44792.857142857145

##### Průměrný plat v Liberci

In [24]:
prum_plat_liberec = propoj_tabulky.loc[propoj_tabulky["mesto"] == "Liberec", "plat"].mean()
print(prum_plat_plzen)

44792.857142857145

## Zadání 2

### Pokračuj ve své práci pro softwarovou firmu. Ze souboru vykazy.csv načti informace o výkazech na projekty pro jednoho vybraného zákazníka.

#### Načti data ze souboru a ulož je do tabulky.

In [25]:
vykazy = pandas.read_csv("vykazy.csv")
vykazy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        27 non-null     object
 1   hours       27 non-null     float64
 2   project     27 non-null     object
 3   emloyee_id  27 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 992.0+ bytes

#### Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [27]:
vykazane_hodiny = vykazy.groupby("project")["hours"].sum()
print(vykazane_hodiny)

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64